Autodesk.Revit.UI.IManageLinkServerBase.OnPathTypesChanged(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.UI.ExternalDataManagerDataItemId},System.String)
Handles the path type change, from absolute to relative or vice versa.

Autodesk.Revit.UI.IManageLinkServerBase.OnPathTypeChanged(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerDataItemId,System.String)
Handles the path type change, from absolute to relative or vice versa.

Autodesk.Revit.UI.IManageLinkServerBase
Built-in external server for Manage Links dialog